{
  "title": "Lunar API Service - Documentaci칩n",
  "header": {
    "title": "游깿 Lunar API Service",
    "subtitle": "Un servicio API confiable para las fases lunares"
  },
  "sections": {
    "introduction": {
      "title": "Introducci칩n",
      "paragraph1": "Lunar API Service es una API RESTful que proporciona informaci칩n precisa sobre las fases lunares. Puede utilizar esta API para obtener datos sobre la fase lunar actual, una fecha espec칤fica o para obtener informaci칩n lunar detallada.",
      "paragraph2": "La API est치 disponible 24/7 y est치 alojada en Vercel, garantizando alta disponibilidad y baja latencia."
    },
    "endpoints": {
      "title": "Puntos de conexi칩n API",
      "currentPhase": {
        "title": "Fase Lunar Actual",
        "description": "Devuelve la fase lunar actual con iluminaci칩n y emoji correspondiente."
      },
      "specificDate": {
        "title": "Fase Lunar para una Fecha Espec칤fica",
        "description": "Devuelve la fase lunar para una fecha espec칤fica. El formato de la fecha debe ser AAAA-MM-DD."
      },
      "detailedInfo": {
        "title": "Informaci칩n Lunar Detallada",
        "description": "Devuelve informaci칩n lunar detallada, incluyendo edad, distancia, pr칩xima luna llena y luna nueva."
      },
      "response": "Ejemplo de respuesta:",
      "tryIt": "Pruebe este punto de conexi칩n:",
      "executeRequest": "Ejecutar solicitud"
    },
    "phases": {
      "title": "Fases Lunares y Emojis",
      "description": "La API devuelve un emoji correspondiente a la fase lunar actual. Aqu칤 hay una gu칤a de las fases lunares y sus emojis relacionados:",
      "newMoon": "Luna Nueva",
      "waxingCrescent": "Luna Creciente",
      "firstQuarter": "Cuarto Creciente",
      "waxingGibbous": "Gibosa Creciente",
      "fullMoon": "Luna Llena",
      "waningGibbous": "Gibosa Menguante",
      "lastQuarter": "Cuarto Menguante",
      "waningCrescent": "Luna Menguante"
    },
    "usage": {
      "title": "Uso en JavaScript",
      "description": "Aqu칤 hay un ejemplo de c칩mo usar la API en JavaScript:"
    },
    "limits": {
      "title": "L칤mites y Consideraciones",
      "description": "La API es gratuita y no requiere autenticaci칩n. Sin embargo, por favor 칰sela de manera responsable. Los c치lculos lunares se basan en algoritmos astron칩micos y proporcionan resultados precisos para fechas entre 1900 y 2100."
    },
    "security": {
      "title": "Seguridad",
      "description": "La API Lunar ha sido dise침ada con la seguridad como prioridad. Aqu칤 est치n las medidas de seguridad implementadas:",
      "rateLimiting": "Limitaci칩n de tasa: Para prevenir abusos, la API limita las solicitudes a 100 por IP cada 15 minutos.",
      "inputValidation": "Validaci칩n de entrada: Todas las entradas son estrictamente validadas para prevenir ataques de inyecci칩n.",
      "securityHeaders": "Cabeceras de seguridad: La API utiliza cabeceras de seguridad modernas para proteger contra ataques comunes como XSS y CSRF.",
      "https": "HTTPS: Todas las comunicaciones est치n cifradas a trav칠s de HTTPS.",
      "monitoring": "Monitoreo: La actividad de la API es monitoreada para identificar y bloquear comportamientos sospechosos.",
      "contact": "Si encuentra problemas de seguridad o tiene sugerencias para mejorar la seguridad de la API, por favor cont치ctenos en"
    }
  },
  "footer": {
    "copyright": "Lunar API Service 춸 2023 - Desarrollado por",
    "available": "Disponible en",
    "useful": "Si encuentra 칰til este proyecto,",
    "star": "춰deje una estrella en GitHub!"
  },
  "ui": {
    "loading": "Cargando...",
    "error": "Error:",
    "selectDate": "Seleccione una fecha",
    "language": "Idioma"
  }
} 